#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
heroku_app.api: Refreshing state... [id=adtest-recipe-app-api]
heroku_addon.database: Refreshing state... [id=55f3abdf-e979-4c95-b7ec-e13b999a49ba]
heroku_build.api: Refreshing state... [id=20f7133b-d16f-4c79-8bdd-2c3e8bcad0d1]
heroku_formation.api: Refreshing state... [id=4eed8fca-5954-455e-a770-5554e7e2664e]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # heroku_build.api has been changed
  ~ resource "heroku_build" "api" {
        id                = "20f7133b-d16f-4c79-8bdd-2c3e8bcad0d1"
      ~ output_stream_url = "https://build-output.heroku.com/streams/f4/f4355849-909b-42b9-833f-ef8260379e4f/logs/20/20f7133b-d16f-4c79-8bdd-2c3e8bcad0d1.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20210815%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20210815T080636Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=1a64b6590d349fbcdffa6f70232841377010eabc739fedf6df76f9fc0644e967" -> "https://build-output.heroku.com/streams/f4/f4355849-909b-42b9-833f-ef8260379e4f/logs/20/20f7133b-d16f-4c79-8bdd-2c3e8bcad0d1.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20210815%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20210815T110955Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=39d849e7137cbea87101b75e8a97b6d92cf575118e1c239bf2875394d12a5341"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # heroku_app.api will be updated in-place
  ~ resource "heroku_app" "api" {
        id                    = "adtest-recipe-app-api"
        name                  = "adtest-recipe-app-api"
      ~ sensitive_config_vars = (sensitive value)
        # (11 unchanged attributes hidden)
    }

  # heroku_build.api must be replaced
-/+ resource "heroku_build" "api" {
      ~ id                = "20f7133b-d16f-4c79-8bdd-2c3e8bcad0d1" -> (known after apply)
      ~ local_checksum    = "SHA256:07a822ae8c8d74abf86fc8afc066bfdda5df119de5ef405b2ac44578fa4369b2" -> "SHA256:0a7d38be4a8e4f6a450c44ef1f3ef4534eb98c1f186e0cc00f1be8f8b4365357" # forces replacement
      ~ output_stream_url = "https://build-output.heroku.com/streams/f4/f4355849-909b-42b9-833f-ef8260379e4f/logs/20/20f7133b-d16f-4c79-8bdd-2c3e8bcad0d1.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20210815%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20210815T110955Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=39d849e7137cbea87101b75e8a97b6d92cf575118e1c239bf2875394d12a5341" -> (known after apply)
      ~ release_id        = "90bf4c74-cbd0-4deb-a9c2-4f28c3cc06af" -> (known after apply)
      ~ slug_id           = "8ef87cd6-1377-4b4e-8ace-5bf5778bb955" -> (known after apply)
      ~ stack             = "heroku-20" -> (known after apply)
      ~ status            = "succeeded" -> (known after apply)
      ~ user              = [
          - {
              - email = "n13m4n0@gmail.com"
              - id    = "692ce5d5-b009-41f5-8e30-daa6b6ae9b7b"
            },
        ] -> (known after apply)
      ~ uuid              = "20f7133b-d16f-4c79-8bdd-2c3e8bcad0d1" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ source {
          + checksum = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # random_password.password will be created
  + resource "random_password" "password" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "_%@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 2 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @noVerity, Action: `pull_request`, Working Directory: ``, Workflow: `Plan Terraform`*